# synth.ys
read_verilog fn.v
hierarchy -auto-top
proc; opt
techmap; opt
abc -g NAND
show -format png -prefix output/add1_nand
write_verilog output/fn_nand.v
write_json output/fn_nand.json
